## Contents
1. Importing libraries
2. Reading data, setting up
3. Testing mixed datatypes
4. Products data consistency checks
5. Orders data consistency checks

### Importing Libraries

In [3]:
# importing libraries
import pandas as pd
import numpy as np
import os

### 2. Reading data, setting up

In [4]:
# reading products and orders data
path_org = r'C:\Users\Richárd\Desktop\CareerFoundry\Data Immersion\Archievment 4\Instacart_Basket_Analysis_2023_04_03\02_Data\Original_Data'
path_prep = r'C:\Users\Richárd\Desktop\CareerFoundry\Data Immersion\Archievment 4\Instacart_Basket_Analysis_2023_04_03\02_Data\Prepared_Data'
df_prods = pd.read_csv(os.path.join(path_org, 'products.csv'), index_col = None)
df_ords = pd.read_csv(os.path.join(path_prep, 'orders_wrangled.csv'), index_col = None)

### 3. Testing mixed datatypes

In [5]:
# setting up test dataframe
df_test = pd.DataFrame()
df_test['mix'] = ['a', 'b', 1, True]
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [6]:
# looping through test dataframe columns [converted to lists], mapping them for different datatypes
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [7]:
# converting mix column to str
df_test['mix'] = df_test['mix'].astype('str')

### 4. Products data consistency checks

In [8]:
# summing up null values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [9]:
# looking at only null values
df_nan = df_prods[df_prods['product_name'].isnull() == True]
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [10]:
df_prods.shape

(49693, 5)

In [11]:
# filtering out null values, assigning them to a new variable
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]
df_prods_clean.shape

(49677, 5)

In [12]:
# identifying duplicates, assigning them to a variable
df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [13]:
# Getting rid of duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
df_prods_clean_no_dups.shape

(49672, 5)

### 5. Orders data consistency checks

In [14]:
# Task 1. - Please see above

In [15]:
# Task 2. 
df_ords.describe() # - nothing out of the ordinary here

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_after_previous_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [16]:
# Task2+ products data was never checked
df_prods_clean_no_dups.describe() # - not so cean after all! 99999.000000 for max price seems quite extreme, wort looking into

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [17]:
# Task 3. - Checking for mixed datatypes in orders data
for col in df_ords.columns.tolist():
    is_mixed = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    if len(df_ords[is_mixed]) > 0:
        print(col)
# Task 4. - nothing gets printed, meaning no mixed dataype columns - Nothing to fix

In [18]:
# Task 5. Checking for missing values in orders data
orders_nulls_summary = df_ords.isnull().sum()
orders_nulls_summary # - days_after_previous_order has 206209 null values - likely means that 0 days passed between orders, worth taking a closer look though

Unnamed: 0                        0
order_id                          0
user_id                           0
order_number                      0
orders_day_of_the_week            0
order_hour_of_day                 0
days_after_previous_order    206209
dtype: int64

In [19]:
# exploring reason behind missing values
ords_nulls = df_ords[df_ords['days_after_previous_order'].isnull() == True]
# ords_nulls
exmpl = df_ords[df_ords['order_number'] == 1]
exmpl.isnull().sum()

Unnamed: 0                        0
order_id                          0
user_id                           0
order_number                      0
orders_day_of_the_week            0
order_hour_of_day                 0
days_after_previous_order    206209
dtype: int64

#### Task 5. explaination: Clearly the missing value indicate the first order made by each user - no days could have passed if there is no previous order

#### Task 6. It could be reasonable to flag these as something like 'first_order_of_user', but then we would be dealing with mixed datatype for the column. Replacing them with 0-s would be a bad idea, because it would skew analysis of order frequencies.
#### I think the best solution is to leave them be, but mark it down in the docuentation/data dictionary that nulls mean the very first order made by the user.

In [20]:
# Task 7. - Finding duplicates in orders data
ords_dups = df_ords[df_ords.duplicated()]
ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_the_week, order_hour_of_day, days_after_previous_order]
Index: []

In [21]:
df_prods.shape

(49693, 5)

In [22]:
df_ords.shape

(3421083, 7)

#### Task 7., Task 8. - There appear to be no duplicates, so nothing to do here

In [19]:
# Task 9. - Exporting dataframes to csvs
df_prods_clean_no_dups.to_csv(os.path.join(path_prep, 'products_clean.csv'))
df_ords .to_csv(os.path.join(path_prep, 'orders_clean.csv'))